<template>
  <div class="container">
    <div class="row">
      <div class="col-xl-3 col-lg-4 padding-mobile">
        <AddWordBox />
        <SocialMediaContactBox />
        <img src="../assets/images/advertisement.jpg" class="ads" alt="" />
      </div>
      <div class="col-xl-9 col-lg-8 padding-mobile">
        <WordCard
          v-for="(word, index) in wordCardItems"
          :key="index"
          :data="word"
        />
      </div>
    </div>
  </div>
</template>

<script setup>
import AddWordBox from "@/components/TheLanding/AddWordBox.vue";
import SocialMediaContactBox from "@/components/TheLanding/SocialMediaContactBox.vue";
import WordCard from "@/components/TheLanding/WordCard.vue";
import { ref } from "vue";

//state

const wordCardItems = ref([
  {
    title: "صندلی",
    content:
      "صندلی یا چهار پایه، به فارسی دری: چوکی ( به عربی: کرسی ) ، از اثاث است و برای نشستن بکار می رود.صندلی معمولاً از نشیمن گاه، تکیه گاه، چهارپایه و گاه دو دسته تشکیل شده است.فرم و نوع صندلی برای حفظ سلامتی ستون فقرات، بسیار مهم است.در سرواژهٔ «صندلی» از لغتنامهٔ دهخدا چنین آمده است:سندلی. کرسی که در قدیم کفش پادشاهان بر آن می گذاشتند. ( حاشیه برهان قاطع چ معین ج ۲ ص ۱۳۳۷ ) . و در همین حاشیه از رشیدی آرد که ظاهراً معرب صندلی است - انتهی. نوعی از تخت کوچک که بهندی جوکی گویند. ( غیاث اللغات ) . مرحوم بهار صندلی را جزء لغاتی شمرده است که از روس و اطریش و غیره داخل فارسی شده است. ( سبک شناسی ج ۱ ص ۲۸۱ ) . کرسی پشت دار که بر وی نشینند. زیرگاه: به کرمان آمد و بر پهلوی تخت سلطانی بر صندلی صدارت نشست. ( سمط العلی ص ۸۱ ) . در آن حین از اسب پیاده شده و بر صندلی نشسته، عراقیان را بر محاربه و دستبرد تحریص کرد. ( حبیب السیر ) .",
    author: "نوشته شده توسط user5963, نوشته 1 آذر 1401",
    likeCount: 235,
    disslikeCount: 12,
  },
  {
    title: "صندلی",
    content:
      "صندلی یا چهار پایه، به فارسی دری: چوکی ( به عربی: کرسی ) ، از اثاث است و برای نشستن بکار می رود.صندلی معمولاً از نشیمن گاه، تکیه گاه، چهارپایه و گاه دو دسته تشکیل شده است.فرم و نوع صندلی برای حفظ سلامتی ستون فقرات، بسیار مهم است.در سرواژهٔ «صندلی» از لغتنامهٔ دهخدا چنین آمده است:سندلی. کرسی که در قدیم کفش پادشاهان بر آن می گذاشتند. ( حاشیه برهان قاطع چ معین ج ۲ ص ۱۳۳۷ ) . و در همین حاشیه از رشیدی آرد که ظاهراً معرب صندلی است - انتهی. نوعی از تخت کوچک که بهندی جوکی گویند. ( غیاث اللغات ) . مرحوم بهار صندلی را جزء لغاتی شمرده است که از روس و اطریش و غیره داخل فارسی شده است. ( سبک شناسی ج ۱ ص ۲۸۱ ) . کرسی پشت دار که بر وی نشینند. زیرگاه: به کرمان آمد و بر پهلوی تخت سلطانی بر صندلی صدارت نشست. ( سمط العلی ص ۸۱ ) . در آن حین از اسب پیاده شده و بر صندلی نشسته، عراقیان را بر محاربه و دستبرد تحریص کرد. ( حبیب السیر ) .",
    author: "نوشته شده توسط user5963, نوشته 1 آذر 1401",
    likeCount: 235,
    disslikeCount: 12,
  },
  {
    title: "صندلی",
    content:
      "صندلی یا چهار پایه، به فارسی دری: چوکی ( به عربی: کرسی ) ، از اثاث است و برای نشستن بکار می رود.صندلی معمولاً از نشیمن گاه، تکیه گاه، چهارپایه و گاه دو دسته تشکیل شده است.فرم و نوع صندلی برای حفظ سلامتی ستون فقرات، بسیار مهم است.در سرواژهٔ «صندلی» از لغتنامهٔ دهخدا چنین آمده است:سندلی. کرسی که در قدیم کفش پادشاهان بر آن می گذاشتند. ( حاشیه برهان قاطع چ معین ج ۲ ص ۱۳۳۷ ) . و در همین حاشیه از رشیدی آرد که ظاهراً معرب صندلی است - انتهی. نوعی از تخت کوچک که بهندی جوکی گویند. ( غیاث اللغات ) . مرحوم بهار صندلی را جزء لغاتی شمرده است که از روس و اطریش و غیره داخل فارسی شده است. ( سبک شناسی ج ۱ ص ۲۸۱ ) . کرسی پشت دار که بر وی نشینند. زیرگاه: به کرمان آمد و بر پهلوی تخت سلطانی بر صندلی صدارت نشست. ( سمط العلی ص ۸۱ ) . در آن حین از اسب پیاده شده و بر صندلی نشسته، عراقیان را بر محاربه و دستبرد تحریص کرد. ( حبیب السیر ) .",
    author: "نوشته شده توسط user5963, نوشته 1 آذر 1401",
    likeCount: 235,
    disslikeCount: 12,
  },
  {
    title: "صندلی",
    content:
      "صندلی یا چهار پایه، به فارسی دری: چوکی ( به عربی: کرسی ) ، از اثاث است و برای نشستن بکار می رود.صندلی معمولاً از نشیمن گاه، تکیه گاه، چهارپایه و گاه دو دسته تشکیل شده است.فرم و نوع صندلی برای حفظ سلامتی ستون فقرات، بسیار مهم است.در سرواژهٔ «صندلی» از لغتنامهٔ دهخدا چنین آمده است:سندلی. کرسی که در قدیم کفش پادشاهان بر آن می گذاشتند. ( حاشیه برهان قاطع چ معین ج ۲ ص ۱۳۳۷ ) . و در همین حاشیه از رشیدی آرد که ظاهراً معرب صندلی است - انتهی. نوعی از تخت کوچک که بهندی جوکی گویند. ( غیاث اللغات ) . مرحوم بهار صندلی را جزء لغاتی شمرده است که از روس و اطریش و غیره داخل فارسی شده است. ( سبک شناسی ج ۱ ص ۲۸۱ ) . کرسی پشت دار که بر وی نشینند. زیرگاه: به کرمان آمد و بر پهلوی تخت سلطانی بر صندلی صدارت نشست. ( سمط العلی ص ۸۱ ) . در آن حین از اسب پیاده شده و بر صندلی نشسته، عراقیان را بر محاربه و دستبرد تحریص کرد. ( حبیب السیر ) .",
    author: "نوشته شده توسط user5963, نوشته 1 آذر 1401",
    likeCount: 235,
    disslikeCount: 12,
  },
  {
    title: "صندلی",
    content:
      "صندلی یا چهار پایه، به فارسی دری: چوکی ( به عربی: کرسی ) ، از اثاث است و برای نشستن بکار می رود.صندلی معمولاً از نشیمن گاه، تکیه گاه، چهارپایه و گاه دو دسته تشکیل شده است.فرم و نوع صندلی برای حفظ سلامتی ستون فقرات، بسیار مهم است.در سرواژهٔ «صندلی» از لغتنامهٔ دهخدا چنین آمده است:سندلی. کرسی که در قدیم کفش پادشاهان بر آن می گذاشتند. ( حاشیه برهان قاطع چ معین ج ۲ ص ۱۳۳۷ ) . و در همین حاشیه از رشیدی آرد که ظاهراً معرب صندلی است - انتهی. نوعی از تخت کوچک که بهندی جوکی گویند. ( غیاث اللغات ) . مرحوم بهار صندلی را جزء لغاتی شمرده است که از روس و اطریش و غیره داخل فارسی شده است. ( سبک شناسی ج ۱ ص ۲۸۱ ) . کرسی پشت دار که بر وی نشینند. زیرگاه: به کرمان آمد و بر پهلوی تخت سلطانی بر صندلی صدارت نشست. ( سمط العلی ص ۸۱ ) . در آن حین از اسب پیاده شده و بر صندلی نشسته، عراقیان را بر محاربه و دستبرد تحریص کرد. ( حبیب السیر ) .",
    author: "نوشته شده توسط user5963, نوشته 1 آذر 1401",
    likeCount: 235,
    disslikeCount: 12,
  },
  {
    title: "صندلی",
    content:
      "صندلی یا چهار پایه، به فارسی دری: چوکی ( به عربی: کرسی ) ، از اثاث است و برای نشستن بکار می رود.صندلی معمولاً از نشیمن گاه، تکیه گاه، چهارپایه و گاه دو دسته تشکیل شده است.فرم و نوع صندلی برای حفظ سلامتی ستون فقرات، بسیار مهم است.در سرواژهٔ «صندلی» از لغتنامهٔ دهخدا چنین آمده است:سندلی. کرسی که در قدیم کفش پادشاهان بر آن می گذاشتند. ( حاشیه برهان قاطع چ معین ج ۲ ص ۱۳۳۷ ) . و در همین حاشیه از رشیدی آرد که ظاهراً معرب صندلی است - انتهی. نوعی از تخت کوچک که بهندی جوکی گویند. ( غیاث اللغات ) . مرحوم بهار صندلی را جزء لغاتی شمرده است که از روس و اطریش و غیره داخل فارسی شده است. ( سبک شناسی ج ۱ ص ۲۸۱ ) . کرسی پشت دار که بر وی نشینند. زیرگاه: به کرمان آمد و بر پهلوی تخت سلطانی بر صندلی صدارت نشست. ( سمط العلی ص ۸۱ ) . در آن حین از اسب پیاده شده و بر صندلی نشسته، عراقیان را بر محاربه و دستبرد تحریص کرد. ( حبیب السیر ) .",
    author: "نوشته شده توسط user5963, نوشته 1 آذر 1401",
    likeCount: 235,
    disslikeCount: 12,
  },
  {
    title: "صندلی",
    content:
      "صندلی یا چهار پایه، به فارسی دری: چوکی ( به عربی: کرسی ) ، از اثاث است و برای نشستن بکار می رود.صندلی معمولاً از نشیمن گاه، تکیه گاه، چهارپایه و گاه دو دسته تشکیل شده است.فرم و نوع صندلی برای حفظ سلامتی ستون فقرات، بسیار مهم است.در سرواژهٔ «صندلی» از لغتنامهٔ دهخدا چنین آمده است:سندلی. کرسی که در قدیم کفش پادشاهان بر آن می گذاشتند. ( حاشیه برهان قاطع چ معین ج ۲ ص ۱۳۳۷ ) . و در همین حاشیه از رشیدی آرد که ظاهراً معرب صندلی است - انتهی. نوعی از تخت کوچک که بهندی جوکی گویند. ( غیاث اللغات ) . مرحوم بهار صندلی را جزء لغاتی شمرده است که از روس و اطریش و غیره داخل فارسی شده است. ( سبک شناسی ج ۱ ص ۲۸۱ ) . کرسی پشت دار که بر وی نشینند. زیرگاه: به کرمان آمد و بر پهلوی تخت سلطانی بر صندلی صدارت نشست. ( سمط العلی ص ۸۱ ) . در آن حین از اسب پیاده شده و بر صندلی نشسته، عراقیان را بر محاربه و دستبرد تحریص کرد. ( حبیب السیر ) .",
    author: "نوشته شده توسط user5963, نوشته 1 آذر 1401",
    likeCount: 235,
    disslikeCount: 12,
  },
  {
    title: "صندلی",
    content:
      "صندلی یا چهار پایه، به فارسی دری: چوکی ( به عربی: کرسی ) ، از اثاث است و برای نشستن بکار می رود.صندلی معمولاً از نشیمن گاه، تکیه گاه، چهارپایه و گاه دو دسته تشکیل شده است.فرم و نوع صندلی برای حفظ سلامتی ستون فقرات، بسیار مهم است.در سرواژهٔ «صندلی» از لغتنامهٔ دهخدا چنین آمده است:سندلی. کرسی که در قدیم کفش پادشاهان بر آن می گذاشتند. ( حاشیه برهان قاطع چ معین ج ۲ ص ۱۳۳۷ ) . و در همین حاشیه از رشیدی آرد که ظاهراً معرب صندلی است - انتهی. نوعی از تخت کوچک که بهندی جوکی گویند. ( غیاث اللغات ) . مرحوم بهار صندلی را جزء لغاتی شمرده است که از روس و اطریش و غیره داخل فارسی شده است. ( سبک شناسی ج ۱ ص ۲۸۱ ) . کرسی پشت دار که بر وی نشینند. زیرگاه: به کرمان آمد و بر پهلوی تخت سلطانی بر صندلی صدارت نشست. ( سمط العلی ص ۸۱ ) . در آن حین از اسب پیاده شده و بر صندلی نشسته، عراقیان را بر محاربه و دستبرد تحریص کرد. ( حبیب السیر ) .",
    author: "نوشته شده توسط user5963, نوشته 1 آذر 1401",
    likeCount: 235,
    disslikeCount: 12,
  },
]);
</script>

<style>
</style>